# -*- coding: utf-8 -*-
class DsaConstants:
    """Lookup values retrieved from html comment tags."""
    MAPPINGS = {
        "DOCTYPE": {
            "1": "вирок",
            "2": "рішення",
            "3": "постанова",
            "4": "ухвала суду",
            "5": "судовий наказ",
            "6": "окрема ухвала",
        },
        "CAUSETYPE": {
            "1": "адміністративна",
            "2": "кримінальна",
            "3": "господарська",
            "4": "цивільна",
            "5": "адміністративне правопорушення",
        },
        "HEARINGCLOSED": {
            "V": "не заборонено",
            "Z": "заборонено",
            "T": "заборонено тимчасово",
        },
        "MEMBTYPE": {
            "P": "позивач",
            "V": "відповідач",
        },
        "MEMBPOZYVACHTYPE": {
            "P": "позивач",
            "Z": "заявник",
            "S": "стягувач",
            "O": "орган",
            "K": "кредитор",
            "B": "обвинувач",
            "C": "цивільний позивач",
            "A": "заінтересована особа",
            "I": "інша особа",
        },
        "MEMBVIDPOVIDACHTYPE": {
            "V": "відповідач",
            "C": "цивільний відповідач",
            "P": "адмін.правопорушник",
            "B": "боржник",
            "D": "підсудний",
            "I": "інша особа",
        },
        "MEMBOSOBATYPE": {
            "U": "юридична",
            "F": "фізична",
        },
        "CAUSELOCATION": {
            "P": "перша",
            "A": "апеляційна",
            "C": "касаційна",
            "I": "інша",
        }
    }
